Revit 2024 API
IFCLevelInfo.GetRelatedElements Method
 Gets all building elements on this level.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<IFCAnyHandle> GetRelatedElements()
Visual Basic
Public Function GetRelatedElements As ICollection(Of IFCAnyHandle)
Visual C++
public:
ICollection<IFCAnyHandle^>^ GetRelatedElements()
Return Value
 The collection of elements.
See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace